/*二维数组名引用示例*/
/*二维数组的地址*/

int main()
{
  int a[3][4]={{1,2,3,4},{5,6,7,8},{9，10，11，12}};
  cout<<"a="<<a<<endl;                        //0x0013FF50 a[0][0]的地址
  cout<<"&a[0]="<< &a[0]<<endl<<endl;        //0x0013FF50 a[0][0]的地址

  cout<<"a+1="<<a+1<<endl;                   //0x0013F60 a[1][0]的地址
  cout<<"&a[0]+1"<<&a[0]+1<<endl<<endl;     //0x0013F60 a[1][0]的地址

  cout<<"*a="<<*a<<endl;                   //0x0013FF50 a[0][0]的地址
  cout<<"a[0]="<<a[0]<<endl;              //0x0013FF50 a[0][0]的地址
  cout<<"&a[0][0]"<<&a[0][0]<<endl<<endl;  //0x0013FF50 a[0][0]的地址

  cout<<"*a+1="<<*a+1<<endl;                //a[0][1]的地址 0x0013FF54
  cout<<"a[0]+1="<<a[0]<<endl;             //a[0][1]的地址0 x0013FF54
  cout<<"&a[0][0]+1="<<&a[0][0]+1<<endl<<endl; //a[0][1]的地址0 x0013FF54
  reutrn 0;
}
/******************************************************/
/*示例2*/
#include<iostream.h>
void main()
{
  int a[3][4]={{1,2,3,4},{5,6,7,8},{9，10，11，12}};
  cout<<"a="<<a<<endl;                        //0x0013FF50 a[0][0]的地址
  cout<<"&a[0]="<< &a[0]<<endl<<endl;        //0x0013FF50 a[0][0]的地址

  cout<<"a+1="<<a+1<<endl;                   //0x0013F60 a[1][0]的地址
  cout<<"&a[0]+1"<<&a[0]+1<<endl<<endl;     //0x0013F60 a[1][0]的地址

  cout<<"a[1]="<<a[1]<<endl;           //指向a[1][0]的指针
  cout<<"&a[1]="<<&a[1]<<endl;        //指向整个a[1]小数组的指针
  cout<<"*(a+1)="<<*(a+1)<<endl;     //指向a[1][0]的指针

  cout<<"*a+1="<<*a+1<<endl<<endl; //指向a[0][1]的指针

  cout<<"&a="<<&a<<endl;  //指向整个二维数组的指针
  cout<<"&a+1="<<&a+1<<endl;  //最后一个元素的下一个地址
  return 0；
}


}
